---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn1
source: html/bba5f816-36c7-c34e-9aed-07ae94a14dd0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn1 Property

"Exterior Major Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeFrontDirn1 { get; }
```